[{"isbn":"0441104029","title":"Children of Dune (Dune Chronicles, Book Three)","author":"Frank Herbert","description":"<div>The desert planet of Arrakis has begun to grow green and lush. The life-giving spice is abundant. The nine-year-old royal twins, possesing their father's supernatural powers, are being groomed as Messiahs.<br><p> But there are those who think the Imperium does not need messiahs...</p></div>","numberOfPages":"416","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441104029_sm.jpg","medium":"/uploads/covers/0441104029_md.jpg","large":"/uploads/covers/0441104029_lg.jpg"}},{"isbn":"0451457994","title":"2001: A Space Odyssey","author":"Arthur C. Clarke","numberOfPages":"296","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451457994_sm.jpg","medium":"/uploads/covers/0451457994_md.jpg","large":"/uploads/covers/0451457994_lg.jpg"}},{"isbn":"0553587579","title":"Foundation and Earth","author":"Isaac Asimov","description":"The fifth novel in Asimov's popular Foundation series opens with second thoughts. Councilman Golan Trevize is wondering if he was right to choose a collective mind as the best possible future for humanity over the anarchy of contentious individuals, nations and planets. To test his conclusion, he decides he must know the past and goes in search of legendary Earth, all references to which have been erased from galactic libraries. The societies encountered along the way become arguing points in a book-long colloquy about man's fate, conducted by Trevize and traveling companion Bliss, who is part of the first world/mind, Gaia.","numberOfPages":"528","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553587579_sm.jpg","medium":"/uploads/covers/0553587579_md.jpg","large":"/uploads/covers/0553587579_lg.jpg"}},{"isbn":"0812550307","title":"The Fires of Heaven (The Wheel of Time, Book 5)","author":"Robert Jordan","description":"<div><i>The Wheel of Time</i> turns, and Ages come and go. What was, what will be, and what is, may yet fall under the Shadow.<br><br><i>Let the Dragon ride again on the winds of time.</i><br></div>","numberOfPages":"992","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812550307_sm.jpg","medium":"/uploads/covers/0812550307_md.jpg","large":"/uploads/covers/0812550307_lg.jpg"}},{"isbn":"0553593714","title":"A Game of Thrones (A Song of Ice and Fire, Book 1)","author":"George R.R. Martin","numberOfPages":"864","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553593714_sm.jpg","medium":"/uploads/covers/0553593714_md.jpg","large":"/uploads/covers/0553593714_lg.jpg"}},{"isbn":"0061936456","title":"Creatures of Light and Darkness","author":"Roger Zelazny","description":"<p class=MsoNormal style=\"MARGIN: 0in 0in 0pt; LINE-HEIGHT: normal\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: 'Times New Roman','serif'\">“Nobody else made myths real and valuable in the way Roger Zelazny could.”<br />—Neil Gaiman<?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" /><o:p></o:p></span></p><p class=MsoNormal style=\"MARGIN: 0in 0in 0pt; LINE-HEIGHT: normal\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: 'Times New Roman','serif'\"><o:p> </o:p></span></p><p class=MsoNormal style=\"MARGIN: 0in 0in 0pt; LINE-HEIGHT: normal\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: 'Times New Roman','serif'\">“He writes about science as if it were magic and magic as if it were science.”<br />—<em>New York Times Book Review</em><br /><br />The author of more than 50 books and winner of multiple Hugo and Nebula Awards, the incomparable Roger Zelazny remains one of the most revered names in sf and fantasy. Back in print at long last is the master’s classic novel <em>Creatures of Light and Darkness. </em>S<span style=\"COLOR: black\">et on a faraway world, the</span> semi<span style=\"COLOR: black\">nal tale of a battle between Ancient Egyptian gods, <em>Creatures of Light and Darkness </em>is a grand display of the imagination, wit, and audacious genius that has placed Zelazny eternally alongside Heinlein, Asimov, Phillip K. Dick, and other legendary genre masters.<o:p></o:p></span></span></p>","numberOfPages":"208","price":{"amount":13.99,"currency":"USD"},"images":{"small":"/uploads/covers/0061936456_sm.jpg","medium":"/uploads/covers/0061936456_md.jpg","large":"/uploads/covers/0061936456_lg.jpg"}},{"isbn":"0380471752","title":"The Courts of Chaos (The Chronicles of Amber Series, Book 5)","author":"Roger Zelazny","description":"Corwin finds his world dissolving around him when his father  Oberon, disguised as Corwin's friend, steals the Jewel of Judgment so  that he may defeat the evil Brand, in a conclusion to the first Amber  series. Reissue.","numberOfPages":"142","price":{"amount":4.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380471752_sm.jpg","medium":"/uploads/covers/0380471752_md.jpg","large":"/uploads/covers/0380471752_lg.jpg"}},{"isbn":"0553579908","title":"A Clash of Kings (A Song of Ice and Fire, Book 2)","author":"George R.R. Martin","numberOfPages":"1040","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553579908_sm.jpg","medium":"/uploads/covers/0553579908_md.jpg","large":"/uploads/covers/0553579908_lg.jpg"}},{"isbn":"0547773749","title":"A Wizard of Earthsea (The Earthsea Cycle)","author":"Ursula K. Le Guin","numberOfPages":"320","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0547773749_sm.jpg","medium":"/uploads/covers/0547773749_md.jpg","large":"/uploads/covers/0547773749_lg.jpg"}},{"isbn":"0553283685","title":"Hyperion (Hyperion Cantos)","author":"Dan Simmons","numberOfPages":"481","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553283685_sm.jpg","medium":"/uploads/covers/0553283685_md.jpg","large":"/uploads/covers/0553283685_lg.jpg"}},{"isbn":"1940026032","title":"The Atlantis Plague: A Thriller (The Origin Mystery, Book 2)","author":"A.G. Riddle","description":"<i>The Atlantis Plague</i> is the second book in <i>The Origin Mystery</i>, the blockbuster trilogy that has sold a million copies in the US, is being translated into eighteen languages, and is in development to be a major motion picture.<br>__________________________________________________________________<br><br><b>A PANDEMIC 70,000 YEARS IN THE MAKING...<br>WILL CHANGE HUMANITY...<br>FOREVER.</b><br>__________________________________________________________________<br><br>In Marbella, Spain, Dr. Kate Warner awakens to a horrifying reality: the human race stands on the brink of extinction. A pandemic unlike any before it has swept the globe. Nearly a billion people are dead--and those the Atlantis Plague doesn't kill, it transforms at the genetic level. A few rapidly evolve. The remainder devolve.<br><br>As the world slips into chaos, radical solutions emerge. Industrialized nations offer a miracle drug, Orchid, which they mass produce and distribute to refugee camps around the world. But Orchid is merely a way to buy time. It treats the symptoms of the plague but never cures the disease.<br><br>Immari International offers a different approach: do nothing. Let the plague run its course. The Immari envision a world populated by the genetically superior survivors--a new human race, ready to fulfill its destiny.<br><br>With control of the world population hanging in the balance, the Orchid Alliance and the Immari descend into open warfare. Now humanity's last hope is to find a cure, and Kate alone holds the key to unraveling the mystery surrounding the Atlantis Plague. The answer may lie in understanding pivotal events in human history--events when the human genome mysteriously changed. Kate's journey takes her across the barren wastelands of Europe and northern Africa, but it's her research into the past that takes her where she never expected to go. She soon discovers that the history of human evolution is not what it seems--and setting it right may require a sacrifice she never imagined.<br>__________________________________________________________________<br><br>\"The human race must remain as one. All other roads lead to ruin.\"<br><i>- The Orchid Alliance</i><br><br>\"Evolution is inevitable. Only fools fight fate.\"<br><i>- Immari International</i><br>__________________________________________________________________<br><br><b>ABOUT:</b><br><i>THE ATLANTIS PLAGUE</i> is a story of human survival and perseverance in the face of extinction. This global adventure takes readers back into the world of <i>The Origin Mystery</i>, which began with A.G. Riddle's debut sci-fi thriller, <i>THE ATLANTIS GENE</i>. <i>THE ATLANTIS PLAGUE</i> delivers the same kind of little-known science and history readers applauded in <i>THE ATLANTIS GENE</i> and deepens the core mystery many can't stop talking about. The series is currently in development at CBS Films to be a major motion picture.<br><br><b>All three books in the trilogy are now available:</b><br> Book 1: The Atlantis Gene -- amazon.com/dp/1940026016<br> Book 2: The Atlantis Plague -- amazon.com/dp/1940026032<br> Book 3: The Atlantis World -- amazon.com/dp/1940026067","numberOfPages":"424","price":{"amount":15.99,"currency":"USD"},"images":{"small":"/uploads/covers/1940026032_sm.jpg","medium":"/uploads/covers/1940026032_md.jpg","large":"/uploads/covers/1940026032_lg.jpg"}},{"isbn":"0812513711","title":"The Dragon Reborn (The Wheel of Time, Book 3)","author":"Robert Jordan","description":"<div>The Wheel of Time turns, and Ages come and pass. What was, what will be, and what is, may yet fall under the Shadow.<br><br>Rand Al'Thor is the Dragon Reborn-- able to touch the One Power, but unable to control it. Rand knows only that he must face the Dark One in a battle to the death. Ahead of him lies the next great test for...<br><br><i>The Dragon Reborn</i><br></div>","numberOfPages":"704","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812513711_sm.jpg","medium":"/uploads/covers/0812513711_md.jpg","large":"/uploads/covers/0812513711_lg.jpg"}},{"isbn":"0451530705","title":"The Time Machine / The Invisible Man (Signet Classics)","author":"H.G. Wells","description":"<div>Two classic science fiction novels in one handsome volume.<br><br> Here are two masterpieces of irony and imaginative vision from the father of science fiction. <i>The Time Machine</i> propels the Time Traveller into a distant, dismal, Darwinian future. <i>The Invisible Man</i> tells of a brash young scientist who becomes invisible, then insane.<br><br></div>","numberOfPages":"320","price":{"amount":5.95,"currency":"USD"},"images":{"small":"/uploads/covers/0451530705_sm.jpg","medium":"/uploads/covers/0451530705_md.jpg","large":"/uploads/covers/0451530705_lg.jpg"}},{"isbn":"1476733953","title":"Wool","author":"Hugh Howey","description":"For suspense-filled, post-apocalyptic thrillers, <I>Wool</I> is more than a self-published ebook phenomenon―it’s the new standard in classic science fiction.<BR><BR>In a ruined and toxic future, a community exists in a giant silo underground, hundreds of stories deep. There, men and women live in a society full of regulations they believe are meant to protect them. Sheriff Holston, who has unwaveringly upheld the silo’s rules for years, unexpectedly breaks the greatest taboo of all: He asks to go outside.<BR> <BR>His fateful decision unleashes a drastic series of events. An unlikely candidate is appointed to replace him: Juliette, a mechanic with no training in law, whose special knack is fixing machines. Now Juliette is about to be entrusted with fixing her silo, and she will soon learn just how badly her world is broken. The silo is about to confront what its history has only hinted about and its inhabitants have never dared to whisper. Uprising.<BR> <BR>A <I>New York Times</I> and <I>USA TODAY</I> bestseller, as well as Kindle Book Review’s 2012 Indie Book of the Year, <I>Wool</I> is truly a blockbuster.","numberOfPages":"528","price":{"amount":15.99,"currency":"USD"},"images":{"small":"/uploads/covers/1476733953_sm.jpg","medium":"/uploads/covers/1476733953_md.jpg","large":"/uploads/covers/1476733953_lg.jpg"}},{"isbn":"0451210875","title":"Wizard and Glass: (The Dark Tower #4)(Revised Edition)","author":"Stephen King","numberOfPages":"752","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451210875_sm.jpg","medium":"/uploads/covers/0451210875_md.jpg","large":"/uploads/covers/0451210875_lg.jpg"}},{"isbn":"0812511816","title":"The Eye of the World (The Wheel of Time, Book 1)","author":"Robert Jordan","description":"<DIV>The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow.<BR></DIV>","numberOfPages":"832","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812511816_sm.jpg","medium":"/uploads/covers/0812511816_md.jpg","large":"/uploads/covers/0812511816_lg.jpg"}},{"isbn":"0451210840","title":"The Gunslinger: (The Dark Tower #1)(Revised Edition)","author":"Stephen King","description":"<div>  In 1978 Stephen King introduced the world to the last Gunslinger, Roland of Gilead.  Nothing has been the same since. Over twenty years later the quest for the Dark Tower continues to take readers on a wildly epic ride. Through parallel worlds and across time, Roland must brave desolate wastelands and endless deserts, drifting into the unimaginable and the familiar as the road to the Dark Tower extends beyond its own pages. A classic tale of colossal scopecrossing over terrain from <i>The Stand</i>, <i>The Eyes of the Dragon</i>, <i>Insomnia</i>,<i> The Talisman,</i> <i>Black House</i>, <i>Hearts in Atlantis</i>, <i>Salem’s Lot </i>and other familiar King hauntsthe adventure takes hold with the turn of each page.<br>  <br>   And the tower awaits  <br>  <br>   <b>The First Volume in the Epic DARK TOWER Series<br>  <br>   <u>The Gunslinger</u></b><br>  <br>   This heroic fantasy is set in a world of ominous landscape and macabre menace that is a dark mirror of our own. A spellbinding tale of good versus evil, it features one of Stephen King’s most powerful creationsThe Gunslinger, a haunting figure who embodies the qualities of the lone hero through the ages, from ancient myth to frontier western legend.<br>  <br>   The Gunslinger’s quest involves the pursuit of The Man in Black, a liaison with the sexually ravenous Alice, and a friendship with the kid from Earth called Jake. Both grippingly realistic and eerily dreamlike, here is stunning proof of Stephen King’s storytelling sorcery.</div>","numberOfPages":"336","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451210840_sm.jpg","medium":"/uploads/covers/0451210840_md.jpg","large":"/uploads/covers/0451210840_lg.jpg"}},{"isbn":"0553288202","title":"The Fall of Hyperion","author":"Dan Simmons","numberOfPages":"528","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553288202_sm.jpg","medium":"/uploads/covers/0553288202_md.jpg","large":"/uploads/covers/0553288202_lg.jpg"}},{"isbn":"1940026016","title":"The Atlantis Gene: A Thriller (The Origin Mystery, Book 1)","author":"A.G. Riddle","description":"Read the novel that started it all: <i>The Atlantis Gene</i> is the first book in <i>The Origin Mystery</i>, the trilogy that has sold a million copies in the US, is being translated into eighteen languages, and is in development to be a major motion picture. <br>_____________________________________________________<br><br> <b>THE GREATEST MYSTERY OF ALL TIME...<br>THE HISTORY OF HUMAN ORIGINS...<br>WILL BE REVEALED.</b><br>_____________________________________________________<br><br>70,000 years ago, the human race almost went extinct.<br>We survived, but no one knows how.<br>Until now.<br>The countdown to the next stage of human evolution is about to begin, and humanity might not survive this time.<br>_____________________________________________________ <br><br>The Immari are good at keeping secrets. For 2,000 years, they've hidden the truth about human evolution. They've also searched for an ancient enemy--a threat that could wipe out the human race. Now the search is over.<br><br>Off the coast of Antarctica, a research vessel discovers a mysterious structure buried deep in an iceberg. It has been there for thousands of years, and something is guarding it. As the Immari rush to execute their plan, a brilliant geneticist makes a discovery that could change everything.<br><br>Dr. Kate Warner moved to Jakarta, Indonesia to escape her past. She hasn't recovered from what happened to her, but she has made an incredible breakthrough: a cure for autism. Or so she thinks. What she has found is far more dangerous--for her and the entire human race. Her work could be the key to the next stage of human evolution. In the hands of the Immari, it would mean the end of humanity as we know it.<br><br>Agent David Vale has spent ten years trying to stop the Immari. Now he's out of time. His informant is dead. His organization has been infiltrated. His enemy is hunting him. But when David receives a coded message related to the Immari attack, he risks everything to save the one person that can help him solve it: Dr. Kate Warner.<br><br>Together, Kate and David must race to unravel a global conspiracy and learn the truth about the Atlantis Gene... and human origins. Their journey takes them to the far corners of the globe and into the secrets of their pasts. The Immari are close on their heels and will stop at nothing to obtain Kate's research and force the next stage of human evolution--even if it means killing 99.9% of the world's population. David and Kate can stop them... if they can trust each other. And stay alive.<br><br>_____________________________________________________ <br><br><b>About</b><br>THE ATLANTIS GENE is a thought-provoking technothriller about global genetic experiments, ancient conspiracies, and the mysteries of human evolution. Its complex characters and historical and scientific details will stay with you long after you finish. This fast-paced adventure is the first book in A.G. Riddle's Origin Mystery Series (now in development at CBS Films to be a major motion picture).<br><br><b>NOTE: All three books in the trilogy are now available.</b><br><br>Book 1: The Atlantis Gene -- amazon.com/dp/1940026016<br>Book 2: The Atlantis Plague -- amazon.com/dp/1940026032<br>Book 3: The Atlantis World -- amazon.com/dp/1940026067","numberOfPages":"451","price":{"amount":15.99,"currency":"USD"},"images":{"small":"/uploads/covers/1940026016_sm.jpg","medium":"/uploads/covers/1940026016_md.jpg","large":"/uploads/covers/1940026016_lg.jpg"}},{"isbn":"0312910207","title":"The Time Wanderers","author":"Arkady Strugatsky","description":"No description yet","price":{"amount":2.95,"currency":"USD"},"images":{"small":"/uploads/covers/0312910207_sm.jpg","medium":"/uploads/covers/0312910207_md.jpg","large":"/uploads/covers/0312910207_lg.jpg"}},{"isbn":"0991677196","title":"CyberStorm","author":"Matthew Mather","description":"<i>Sometimes the worst storms aren't from Mother Nature, and sometimes the worst nightmares aren't the ones in our heads. </i>Mike Mitchell, an average New Yorker already struggling to keep his family together, suddenly finds himself fighting just to keep them alive when an increasingly bizarre string of disasters start appearing on the world's news networks. As the world and cyberworld come crashing down, bending perception and reality, a monster snowstorm cuts New York off from the world, turning it into a wintry tomb where nothing is what it seems...<br><br><span>\"</span><b>As a member of the Military that does 'cyber' for his job</b><span>, it's refreshing to finally see a novel that shows how dangerous our transition to an interconnected infrastructure will become without proper safeguards...I couldn't put down!\" - Karic Allegra, Joint Interoperability Command, US NAVY</span><div><br><div>CyberStorm is the newly released novel from Matthew Mather, author of the best-selling sci-fi series Atopia Chronicles. In his other lives, Mather is a leading member of the world's cybersecurity community, as well as a real-life tech visionary and award-winning videogame designer. CyberStorm is a novel for anyone who enjoys insightful, cutting-edge fiction mixed with action and adventure. </div><div></div><div></div>              </div>","numberOfPages":"362","price":{"amount":12.99,"currency":"USD"},"images":{"small":"/uploads/covers/0991677196_sm.jpg","medium":"/uploads/covers/0991677196_md.jpg","large":"/uploads/covers/0991677196_lg.jpg"}},{"isbn":"0441117732","title":"Count Zero","author":"William Gibson","numberOfPages":"246","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441117732_sm.jpg","medium":"/uploads/covers/0441117732_md.jpg","large":"/uploads/covers/0441117732_lg.jpg"}},{"isbn":"0451526341","title":"Animal Farm: Anniversary Edition","author":"George Orwell","numberOfPages":"140","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451526341_sm.jpg","medium":"/uploads/covers/0451526341_md.jpg","large":"/uploads/covers/0451526341_lg.jpg"}},{"isbn":"0812517725","title":"The Great Hunt (The Wheel of Time, Book 2)","author":"Robert Jordan","description":"<div>The Wheel of Time turns and Ages come and pass. What was, what will be, and what is, may yet fall under the Shadow. For centuries, gleemen have told of The Great Hunt of the Horn. Now the Horn itself is found: the Horn of Valere long thought only legend, the Horn which will raise the dead heroes of the ages.<br><br>And it is stolen.<br></div>","numberOfPages":"705","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812517725_sm.jpg","medium":"/uploads/covers/0812517725_md.jpg","large":"/uploads/covers/0812517725_lg.jpg"}},{"isbn":"0553565079","title":"Forward the Foundation","author":"Isaac Asimov","description":"A stunning testament to his creative genius. <i>Forward The Foundation</i> is a the saga's dramatic climax -- the story Asimov fans have been waiting for. An exciting tale of danger, intrigue, and suspense, <i>Forward The Foundation</i> brings to vivid life Asimov's best loved characters: hero Hari Seldon, who struggles to perfect his revolutionary theory of psychohistory to ensure the survival of humanity; Cleon II, the vain and crafty emperor of the Galactic Empire,","numberOfPages":"464","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553565079_sm.jpg","medium":"/uploads/covers/0553565079_md.jpg","large":"/uploads/covers/0553565079_lg.jpg"}},{"isbn":"0553380958","title":"Snow Crash (Bantam Spectra Book)","author":"Neal Stephenson","numberOfPages":"440","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/0553380958_sm.jpg","medium":"/uploads/covers/0553380958_md.jpg","large":"/uploads/covers/0553380958_lg.jpg"}},{"isbn":"0812550285","title":"A Crown of Swords (The Wheel of Time, Book 7)","author":"Robert Jordan","numberOfPages":"896","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812550285_sm.jpg","medium":"/uploads/covers/0812550285_md.jpg","large":"/uploads/covers/0812550285_lg.jpg"}},{"isbn":"0307346617","title":"World War Z: An Oral History of the Zombie War","author":"Max Brooks","description":"“The end was near.” —Voices from the Zombie War<br /><br />The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. <em>World War Z</em> is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years.<br /><br />Ranging from the now infamous village of New Dachang in the United Federation of China, where the epidemiological trail began with the twelve-year-old Patient Zero, to the unnamed northern forests where untold numbers sought a terrible and temporary refuge in the cold, to the United States of Southern Africa, where the Redeker Plan provided hope for humanity at an unspeakable price, to the west-of-the-Rockies redoubt where the North American tide finally started to turn, this invaluable chronicle reflects the full scope and duration of the Zombie War. <br /><br />Most of all, the book captures with haunting immediacy the human dimension of this epochal event. Facing the often raw and vivid nature of these personal accounts requires a degree of courage on the part of the reader, but the effort is invaluable because, as Mr. Brooks says in his introduction, “By excluding the human factor, aren’t we risking the kind of personal detachment from history that may, heaven forbid, lead us one day to repeat it? And in the end, isn’t the human factor the only true difference between us and the enemy we now refer to as ‘the living dead’?”<br /><br />Note: Some of the numerical and factual material contained in this edition was previously published under the auspices of the United Nations Postwar Commission.<br /><br /><br />Eyewitness reports from the first truly global war<br /><br />“I found ‘Patient Zero’ behind the locked door of an abandoned apartment across town. . . . His wrists and feet were bound with plastic packing twine. Although he’d rubbed off the skin around his bonds, there was no blood. There was also no blood on his other wounds. . . . He was writhing like an animal; a gag muffled his growls. At first the villagers tried to hold me back. They warned me not to touch him, that he was ‘cursed.’ I shrugged them off and reached for my mask and gloves. The boy’s skin was . . . cold and gray . . . I could find neither his heartbeat nor his pulse.” —Dr. Kwang Jingshu, Greater Chongqing, United Federation of China<br /><br /><br />“‘Shock and Awe’? Perfect name. . . . But what if the enemy can’t be shocked and awed? Not just won’t, but biologically can’t! That’s what happened that day outside New York City, that’s the failure that almost lost us the whole damn war. The fact that we couldn’t shock and awe Zack boomeranged right back in our faces and actually allowed Zack to shock and awe us! They’re not afraid! No matter what we do, no matter how many we kill, they will never, ever be afraid!” —Todd Wainio, former U.S. Army infantryman and veteran of the Battle of Yonkers<br /><br /><br />“Two hundred million zombies. Who can even visualize that type of number, let alone combat it? . . . For the first time in history, we faced an enemy that was actively waging total war. They had no limits of endurance. They would never negotiate, never surrender. They would fight until the very end because, unlike us, every single one of them, every second of every day, was devoted to consuming all life on Earth.” —General Travis D’Ambrosia, Supreme Allied Commander, Europe<em><br /></em>","numberOfPages":"342","price":{"amount":14.95,"currency":"USD"},"images":{"small":"/uploads/covers/0307346617_sm.jpg","medium":"/uploads/covers/0307346617_md.jpg","large":"/uploads/covers/0307346617_lg.jpg"}},{"isbn":"1940026067","title":"The Atlantis World  (Origin Mystery) (Volume 3)","author":"A.G. Riddle","description":"<i>The Atlantis World</i> is the final book in <i>The Origin Mystery</i>, the blockbuster trilogy that has sold a million copies in the US, is being translated into eighteen languages, and is in development to be a major motion picture.<br>_________________________________________________________<br><br><b>A GLOBAL CATACLYSM BEYOND IMAGINATION...<br>A MYSTERIOUS SIGNAL FROM SPACE...<br>AND ONE LAST HOPE TO SAVE THE HUMAN RACE:<br><br>THE ATLANTIS WORLD.<br><br>As the clock ticks down to humanity's extinction, a team of scientists will risk everything to unravel the secrets of the past.</b><br>_________________________________________________________<br><br>Northern Morocco: Dr. Kate Warner cured a global pandemic, and she thought she could cure herself. She was wrong. And she was wrong about the scope of the Atlantis conspiracy. Humanity faces a new threat, an enemy beyond imagination. With her own time running out and the utter collapse of human civilization looming, a new hope arrives: a coded message from a potential ally.<br><br>Arecibo Observatory: Mary Caldwell has spent her life waiting, watching the stars, looking for signs of intelligent life beyond our world. When that day comes, Mary is thrust into a struggle older than the human race, with far greater stakes. She must decide who to trust, because there's nowhere to hide.<br><br>Antarctica: In the wake of the Atlantis Plague, Dorian Sloane finds himself a puppet to Ares' mysterious agenda. When Dorian moves to take control of the situation, Ares unleashes a cataclysm that changes everything. As the catastrophe circles the globe, Ares reveals the true nature of the threat to humanity, and Dorian agrees to one last mission: find and kill David Vale and Kate Warner. There will be no prisoners this time. The orders are seek and destroy, and Dorian has been promised that his own answers and salvation lie on the other side.<br><br>With Dorian in pursuit, Kate, David, and their team race through the ruins of the Atlantean ship left on Earth, across Atlantean science stations throughout the galaxy, and into the past of a mysterious culture whose secrets could save humanity in its darkest hour. With their own lives on the line and time slipping away, Kate, David and Dorian are put to the ultimate test.<br><br><b>ABOUT</b><br><i>The Atlantis World</i> is the final book in A.G. Riddle's bestselling <i>Origin Mystery</i> trilogy. This adventure across space and time explores the history of the Atlantean homeworld and culture, a topic readers have asked about since the release of the first novel in the series, <i>The Atlantis Gene</i>. The trilogy is currently in development at CBS Films to be a major motion picture.<br><br><b>All three books in the trilogy are now available:</b><br><br>Book 1: The Atlantis Gene -- amazon.com/dp/1940026016<br> Book 2: The Atlantis Plague -- amazon.com/dp/1940026032<br> Book 3: The Atlantis World -- amazon.com/dp/1940026067","numberOfPages":"304","price":{"amount":15.99,"currency":"USD"},"images":{"small":"/uploads/covers/1940026067_sm.jpg","medium":"/uploads/covers/1940026067_md.jpg","large":"/uploads/covers/1940026067_lg.jpg"}},{"isbn":"0062225758","title":"Guards! Guards! (Discworld)","author":"Terry Pratchett","description":"<p>Welcome to <em>Guards! Guards!</em>, the eighth book in Terry Pratchett’s legendary Discworld series.</p><p>Long believed extinct, a superb specimen of <em>draco nobilis</em> (\"noble dragon\" for those who don't understand italics) has appeared in Discworld's greatest city. Not only does this unwelcome visitor have a nasty habit of charbroiling everything in its path, in rather short order it is crowned King (it is a <em>noble</em> dragon, after all...). How did it get there? How is the Unique and Supreme Lodge of the Elucidated Brethren of the Ebon Night involved? Can the Ankh-Morpork City Watch restore order – and the Patrician of Ankh-Morpork to power?</p><p>Magic, mayhem, and a marauding dragon...who could ask for anything more?</p>","numberOfPages":"416","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0062225758_sm.jpg","medium":"/uploads/covers/0062225758_md.jpg","large":"/uploads/covers/0062225758_lg.jpg"}},{"isbn":"0553278398","title":"Prelude to Foundation (Foundation, Book 1)","author":"Isaac Asimov","description":"It is the year 12,020 G.E. and Emperor Cleon I sits uneasily on the Imperial throne of Trantor. Here in the great multidomed capital of the Galactic Empire, forty billion people have created a civilization of unimaginable technological and cultural complexity. Yet Cleon knows there are those who would see him fall - those whom he would destroy if only he could read the future.<br><br>Hari Seldon has come to Trantor to deliver his paper on psychohistory, his remarkable theory of prediction. Little does the young Outworld mathematician know that he has already sealed his fate and the fate of humanity. For Hari possesses the prophetic power that makes him the most wanted man in the Empire... the man who holds the key to the future - an apocalyptic power to be know forever after as the Foundation.","numberOfPages":"512","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553278398_sm.jpg","medium":"/uploads/covers/0553278398_md.jpg","large":"/uploads/covers/0553278398_lg.jpg"}},{"isbn":"0060012382","title":"The Wee Free Men (Discworld)","author":"Terry Pratchett","numberOfPages":"375","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060012382_sm.jpg","medium":"/uploads/covers/0060012382_md.jpg","large":"/uploads/covers/0060012382_lg.jpg"}},{"isbn":"0441007317","title":"The Left Hand of Darkness (Ace Science Fiction)","author":"Ursula K. Le Guin","numberOfPages":"320","price":{"amount":16,"currency":"USD"},"images":{"small":"/uploads/covers/0441007317_sm.jpg","medium":"/uploads/covers/0441007317_md.jpg","large":"/uploads/covers/0441007317_lg.jpg"}},{"isbn":"0441172717","title":"Dune","author":"Frank Herbert","numberOfPages":"896","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441172717_sm.jpg","medium":"/uploads/covers/0441172717_md.jpg","large":"/uploads/covers/0441172717_lg.jpg"}},{"isbn":"0618126988","title":"The Silmarillion","author":"J.R.R. Tolkien","description":"<div>A number-one New York Times bestseller when it was originally published, THE SILMARILLION is the core of J.R.R. Tolkien's imaginative writing, a work whose origins stretch back to a time long before THE HOBBIT.<br>     Tolkien considered THE SILMARILLION his most important work, and, though it was published last and posthumously, this great collection of tales and legends clearly sets the stage for all his other writing. The story of the creation of the world and of the the First Age, this is the ancient drama to which the characters in THE LORD OF THE RINGS look back and in whose events some of them, such as Elrond and Galadriel, took part. The three Silmarils were jewels created by Feanor, most gifted of the Elves. Within them was imprisoned the Light of the Two Trees of Valinor before the Trees themselves were destroyed by Morgoth, the first Dark Lord. Thereafter, the unsullied Light of Valinor lived on only in the Silmarils, but they were seized by Morgoth and set in his crown, which was guarded in the impenetrable fortress of Angband in the north of Middle-earth. THE SILMARILLION is the history of the rebellion of Feanor and his kindred against the gods, their exile from Valinor and return to Middle-earth, and their war, hopeless despite all their heroism, against the great Enemy.<br>     This second edition features a letter written by J.R.R. Tolkien describing his intentions for the book, which serves as a brilliant exposition of his conception of the earlier Ages of Middle-earth.</div>","numberOfPages":"365","price":{"amount":14,"currency":"USD"},"images":{"small":"/uploads/covers/0618126988_sm.jpg","medium":"/uploads/covers/0618126988_md.jpg","large":"/uploads/covers/0618126988_lg.jpg"}},{"isbn":"0060013125","title":"Night Watch (Discworld)","author":"Terry Pratchett","description":"<p>One moment, Sir Sam Vimes is in his old patrolman form, chasing a sweet-talking psychopath across the rooftops of Ankh-Morpork. The next, he's lying naked in the street, having been sent back thirty years courtesy of a group of time-manipulating monks who won't leave well enough alone. This Discworld is a darker place that Vimes remembers too well, three decades before his title, fortune, beloved wife, and impending first child. Worse still, the murderer he's pursuing has been transported back also. Worst of all, it's the eve of a fabled street rebellion that needlessly destroyed more than a few good (and not so good) men. Sam Vimes knows his duty, and by changing history he might just save some worthwhile necks—though it could cost him his own personal future. Plus there's a chance to steer a novice watchman straight and teach him a valuable thing or three about policing, an impressionable young copper named Sam Vimes.</p>","numberOfPages":"432","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060013125_sm.jpg","medium":"/uploads/covers/0060013125_md.jpg","large":"/uploads/covers/0060013125_lg.jpg"}},{"isbn":"0689845340","title":"The Farthest Shore (The Earthsea Cycle, Book 3)","author":"Ursula K. Le Guin","description":"DARKNESS THREATENS to overtake Earthsea. As the world and its wizards are losing their magic, Ged -- powerful Archmage, wizard, and dragonlord -- embarks on a sailing journey with highborn young prince, Arren. They travel far beyond the realm of death to discover the cause of these evil disturbances and to restore magic to a land desperately thirsty for it. <BR> With millions of copies sold, <b>Ursula K. Le Guin's Earthsea Cycle</b> has earned a treasured place on the shelves of fantasy lovers everywhere. Complex, innovative, and deeply moral, this quintessential fantasy sequence has been compared with the work of J.R.R. Tolkien and C.S. Lewis, and has helped make Le Guin one of the most distinguished fantasy and science fiction writers of all time. She lives in Portland, Oregon.","numberOfPages":"272","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0689845340_sm.jpg","medium":"/uploads/covers/0689845340_md.jpg","large":"/uploads/covers/0689845340_lg.jpg"}},{"isbn":"0062225677","title":"The Color of Magic (Discworld)","author":"Terry Pratchett","numberOfPages":"288","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0062225677_sm.jpg","medium":"/uploads/covers/0062225677_md.jpg","large":"/uploads/covers/0062225677_lg.jpg"}},{"isbn":"1477848150","title":"Timebound (The Chronos Files Book 1)","author":"Rysa Walker","numberOfPages":"374","price":{"amount":14.95,"currency":"USD"},"images":{"small":"/uploads/covers/1477848150_sm.jpg","medium":"/uploads/covers/1477848150_md.jpg","large":"/uploads/covers/1477848150_lg.jpg"}},{"isbn":"9781613743416","title":"Roadside Picnic (Rediscovered Classics)","author":"Arkady Strugatsky","description":"<div></div><P style=\"MARGIN: 0in 0in 0pt\" class=MsoNormal>Red Schuhart is a stalker, one of those young rebels who are compelled, in spite of extreme danger, to venture illegally into the Zone to collect the mysterious artifacts that the alien visitors left scattered around. His life is dominated by the place and the thriving black market in the alien products. But when he and his friend Kirill go into the Zone together to pick up a “full empty,” something goes wrong. And the news he gets from his girlfriend upon his return makes it inevitable that he’ll keep going back to the Zone, again and again, until he finds the answer to all his problems.</P><P style=\"MARGIN: 0in 0in 0pt\" class=MsoNormal> </P><P style=\"MARGIN: 0in 0in 0pt\" class=MsoNormal>First published in 1972, <I>Roadside Picnic</I> is still widely regarded as one of the greatest science fiction novels, despite the fact that it has been out of print in the United States for almost thirty years. This authoritative new translation corrects many errors and omissions and has been supplemented with a foreword by Ursula K. Le Guin and a new afterword by Boris Strugatsky explaining the strange history of the novel’s publication in Russia.","numberOfPages":"224","price":{"amount":15.95,"currency":"USD"},"images":{"small":"/uploads/covers/9781613743416_sm.jpg","medium":"/uploads/covers/9781613743416_md.jpg","large":"/uploads/covers/9781613743416_lg.jpg"}},{"isbn":"0345423496","title":"3001: The Final Odyssey","author":"Arthur C. Clarke","description":"One thousand years after the Jupiter mission to explore the mysterious Monolith had been destroyed, after Dave Bowman was transformed into the Star Child, Frank Poole drifted in space, frozen and forgotten, leaving the supercomputer HAL inoperable. But now Poole has returned to life, awakening in a world far different from the one he left behind--and just as the Monolith may be stirring once again. . . . <br><br>A Main Selection of the Science Fiction Book Club®<br>Selected by the Literary Guild® and Doubleday Book Club®","numberOfPages":"288","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0345423496_sm.jpg","medium":"/uploads/covers/0345423496_md.jpg","large":"/uploads/covers/0345423496_lg.jpg"}},{"isbn":"0441783589","title":"Starship Troopers","author":"Robert A. Heinlein","numberOfPages":"263","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441783589_sm.jpg","medium":"/uploads/covers/0441783589_md.jpg","large":"/uploads/covers/0441783589_lg.jpg"}},{"isbn":"0380008319","title":"Sign of the Unicorn (The Chronicles of Amber #3)","author":"Roger Zelazny","description":"Accepting the responsibilities as ruler to the world of Amber,  Corwin finds himself the target of sibling treachery, and must seek  guidance in a land of visions, where a sinister prediction foretells  his doom. Reissue.","numberOfPages":"192","price":{"amount":5.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380008319_sm.jpg","medium":"/uploads/covers/0380008319_md.jpg","large":"/uploads/covers/0380008319_lg.jpg"}},{"isbn":"0544466594","title":"Dragons at Crumbling Castle: And Other Tales","author":"Terry Pratchett","description":"<div>This never-before-published collection of fourteen funny and inventive tales by acclaimed author Sir Terry Pratchett features a memorable cast of inept wizards, sensible heroes, and unusually adventuresome tortoises.</div> <div> </div> <div>Including more than one hundred black-and-white illustrations, the appealingly designed book celebrates Pratchett’s inimitable wordplay and irreverent approach to the conventions of storytelling.</div> <div><BR>These accessible and mischievous tales are an ideal introduction for young readers to this beloved author. Established fans of Pratchett’s work will savor the playful presentation of the themes and ideas that inform his best-selling novels.</div>","numberOfPages":"352","price":{"amount":16.99,"currency":"USD"},"images":{"small":"/uploads/covers/0544466594_sm.jpg","medium":"/uploads/covers/0544466594_md.jpg","large":"/uploads/covers/0544466594_lg.jpg"}},{"isbn":"0451210867","title":"The Waste Lands: The Dark Tower, No. 3","author":"Stephen King","description":"<div>  <b>The Third Volume in the Epic Dark Tower Series<br>   <u>The Waste Lands</u></b><br>  <br>  <br>   <i>In 1978, Stephen King introduced the world to the last gunslinger, Roland of Gilead.  Nothing has been the same since. More than twenty years later, the quest for the Dark Tower continues to take readers on a wildly epic ride. Through parallel worlds and across time, Roland must brave desolate wastelands and endless deserts, drifting into the unimaginable and the familiar. A classic tale of colossal scopecrossing over terrain from The Stand, The Eyes of the Dragon, Insomnia, The Talisman, Black House, Hearts in Atlantis, ’Salem’s Lot, and other familiar King hauntsthe adventure takes hold with the turn of each page.<br>  <br>   And the tower awaits....</i><br>  <br>   Roland, The Last Gunslinger, moves ever closer to The Dark Tower of his dreams and nightmaresas he crosses a desert of damnation in a macabre world that is a twisted image of our own. With him are those he has drawn to this world: street-smart Eddie Dean and courageous wheelchair-bound Susannah.<br>  <br>   Ahead of him are mind-rending revelations about who and what is driving him. Against him is arrayed a swelling legion of foesboth more and less than human....</div>","numberOfPages":"590","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451210867_sm.jpg","medium":"/uploads/covers/0451210867_md.jpg","large":"/uploads/covers/0451210867_lg.jpg"}},{"isbn":"0441328008","title":"Heretics of Dune","author":"Frank Herbert","description":"<div>With more than ten million copies sold, <b>Frank Herbert</b>'s magnificent <b>Dune</b> books stand among the major achievements of the human imagination. In this, the fifth and most spectacular <b>Dune</b> book of all, the planet Arrakis--now called Rakis--is becoming desert again. The Lost Ones are returning home from the far reaches of space. The great sandworms are dying. And the children of Dune's children awaken from empire as from a dream, wielding the new power of a heresy called love...</div>","numberOfPages":"480","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441328008_sm.jpg","medium":"/uploads/covers/0441328008_md.jpg","large":"/uploads/covers/0441328008_lg.jpg"}},{"isbn":"0375507256","title":"Cloud Atlas: A Novel","author":"David Mitchell","description":"<b>By the <i>New York Times </i>bestselling author of <i>The Bone Clocks </i>| Shortlisted for the Man Booker Prize</b><br><br>A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity.<br><br><i>Cloud Atlas</i> begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history.<br><br>But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky.<br><br>As wild as a videogame, as mysterious as a Zen koan, <i>Cloud Atlas</i> is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon.<br><br><b>Praise for <i>Cloud Atlas</i></b><br>  <br> “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”<b>—<i>The New York Times Book Review</i></b><br>  <br> “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”<b>—Dave Eggers</b><br>  <br> “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”<b>—<i>People</i></b><br>  <br> “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”<b>—Michael Chabon</b><br>  <br> “<i>Cloud Atlas</i> ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”<b>—<i>The Washington Post Book World</i></b><br>  <br> “Thrilling . . . One of the biggest joys in <i>Cloud Atlas</i> is watching Mitchell sashay from genre to genre without a hitch in his dance step.”<b>—<i>Boston Sunday Globe</i></b><br>  <br> “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”<b>—<i>Los Angeles Times</i></b><br><br><br><i>From the Hardcover edition.</i>","numberOfPages":"528","price":{"amount":16,"currency":"USD"},"images":{"small":"/uploads/covers/0375507256_sm.jpg","medium":"/uploads/covers/0375507256_md.jpg","large":"/uploads/covers/0375507256_lg.jpg"}},{"isbn":"0345547195","title":"The Abyss Beyond Dreams: A Novel of the Commonwealth (Commonwealth: Chronicle of the Fallers)","author":"Peter F. Hamilton","description":"The wait is over. Bestselling science fiction master Peter F. Hamilton is back with the first of a new two-book saga set in his popular Commonwealth universe. Distinguished by deft plotting, a teeming cast of characters, dazzling scientific speculation, and imagination that brings the truly alien to life, <i>The Abyss Beyond Dreams</i> reveals Hamilton as a storyteller of astonishing ingenuity and power.<br>  <br> The year is 3326. Nigel Sheldon, one of the founders of the Commonwealth, receives a visit from the Raiel—self-appointed guardians of the Void, the enigmatic construct at the core of the galaxy that threatens the existence of all that lives. The Raiel convince Nigel to participate in a desperate scheme to infiltrate the Void.<br>  <br> Once inside, Nigel discovers that humans are not the only life-forms to have been sucked into the Void, where the laws of physics are subtly different and mental powers indistinguishable from magic are commonplace. The humans trapped there are afflicted by an alien species of biological mimics—the Fallers—that are intelligent but merciless killers.<br>  <br> Yet these same aliens may hold the key to destroying the threat of the Void forever—if Nigel can uncover their secrets. As the Fallers’ relentless attacks continue, and the fragile human society splinters into civil war, Nigel must uncover the secrets of the Fallers—before he is killed by the very people he has come to save.<br><br><b>Praise for <i>The Abyss Beyond Dreams</i></b><br> <b><i> </i></b><br> “Peter F. Hamilton does a particular kind of planetary politics and space opera very well, and this is a perfect example of it. . . . [<i>The Abyss Beyond Dreams </i>is] a satisfying and well-oiled story, with potential for more epic adventure to come.”<b>—<i>Booklist</i></b><br> <b><i> </i></b><br> “Hugely enjoyable . . . Hamilton is so good at handling big plots, at maintaining forward momentum even as he throws in an unexpected twist—and there’s at least one doozy of a didn’t-see-that-coming moment here.”<b>—<i>SFX</i></b><br> <b><i> </i></b><br> “Engrossing fare . . . The characters, always Hamilton’s strength, remain as distinctive as ever.”<b>—<i>Kirkus Reviews</i></b>","numberOfPages":"640","price":{"amount":30,"currency":"USD"},"images":{"small":"/uploads/covers/0345547195_sm.jpg","medium":"/uploads/covers/0345547195_md.jpg","large":"/uploads/covers/0345547195_lg.jpg"}},{"isbn":"0812550293","title":"The Path of Daggers (The Wheel of Time, Book 8)","author":"Robert Jordan","numberOfPages":"704","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812550293_sm.jpg","medium":"/uploads/covers/0812550293_md.jpg","large":"/uploads/covers/0812550293_lg.jpg"}},{"isbn":"1613748280","title":"Hard to Be a God (Rediscovered Classics)","author":"Arkady Strugatsky","description":"<P style=\"MARGIN: 0in 0in 0pt\">Don Rumata has been sent from Earth to the medieval kingdom of Arkanar with instructions to observe and to save what he can. Masquerading as an arrogant nobleman, a dueler, and a brawler, he is never defeated, but yet he can never kill. With his doubt and compassion, and his deep love for a local girl named Kira, Rumata wants to save the kingdom from the machinations of Don Reba, the first minister to the king. But given his orders, what role can he play? This long overdue translation will reintroduce one of the most profound Soviet-era novels to an eager audience.                                     <div></div><P style=\"MARGIN: 0in 0in 0pt\">Arkady and Boris Strugatsky are widely known as the greatest Russian writers of science fiction, and their 1964 novel <I>Hard to Be a God </I>is considered one of the greatest of their works. Yet until now the only English version (unavailable for over thirty years) was based on a German translation, and was full of errors, infelicities, and misunderstandings. Now, in a new translation by Olena Bormashenko, whose translation of the authors’ <I>Roadside Picnic </I>has received widespread acclaim, here is the definitive edition of this brilliant work. </p><P style=\"TEXT-INDENT: 0.5in; MARGIN: 0in 0in 0pt\">It tells the story of Don Rumata, who has been sent from Earth to the medieval kingdom of Arkanar, with instructions to observe and to influence, but never to directly intervene. Masquerading as an arrogant nobleman, a dueler and a brawler, Don Rumata is never defeated but can never kill. With his doubt and compassion, and his deep love for a local girl named Kira, Rumata wants to save the kingdom from the machinations of Don Reba, the First Minister to the king. But given his orders, what role can he play?</P><P style=\"TEXT-INDENT: 0.5in; MARGIN: 0in 0in 0pt\"><I>Hard to Be a God </I>has inspired a computer game and two movies, including Aleksei German’s long-awaited swan song. This long-overdue translation will reintroduce one of the most profound Soviet-era novels to an eager audience.","numberOfPages":"256","price":{"amount":16.95,"currency":"USD"},"images":{"small":"/uploads/covers/1613748280_sm.jpg","medium":"/uploads/covers/1613748280_md.jpg","large":"/uploads/covers/1613748280_lg.jpg"}},{"isbn":"0553287893","title":"Rendezvous with Rama","author":"Arthur C. Clarke","numberOfPages":"288","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553287893_sm.jpg","medium":"/uploads/covers/0553287893_md.jpg","large":"/uploads/covers/0553287893_lg.jpg"}},{"isbn":"1400065674","title":"The Bone Clocks: A Novel","author":"David Mitchell","numberOfPages":"640","price":{"amount":30,"currency":"USD"},"images":{"small":"/uploads/covers/1400065674_sm.jpg","medium":"/uploads/covers/1400065674_md.jpg","large":"/uploads/covers/1400065674_lg.jpg"}},{"isbn":"0545663261","title":"Mockingjay (The Final Book of The Hunger Games)","author":"Suzanne Collins","numberOfPages":"400","price":{"amount":12.99,"currency":"USD"},"images":{"small":"/uploads/covers/0545663261_sm.jpg","medium":"/uploads/covers/0545663261_md.jpg","large":"/uploads/covers/0545663261_lg.jpg"}},{"isbn":"0385538235","title":"The Compleat Ankh-Morpork","author":"Terry Pratchett","description":"A brand-new street directory of Discworld city Ankh-Morpork complete with a beautifully illustrated pull-out map.<br> <br><i>'There's a saying that all roads lead to Ankh-Morpork. And it's wrong. All roads lead away from Ankh-Morpork, but sometimes people just walk along the wrong way.'</i><br> <br>Ankh-Morpork! City of One Thousand Surprises (according to the famous publication by the Guild of Merchants)! All human life is here! Although, if it walks down the wrong alley, often quite briefly!<br> <br>This is the city celebrated in Terry Pratchett's bestselling Discworld series as you've never seen it before. A stunning map and comprehensive street directory covering each and every district from Unseen University to the Shades, major landmarks like the Patrician's Palace to little-known, er, nooks like Dwarf Bread Museum in Whirligig Alley. See the notorious establishments and famous streets along which so many heroes have walked, in some cases quite hurriedly. As leading Ankh-Morpork entrepreneur CMOT Dibbler would say, 'A nip at any price -- and that's cutting our own throat. Well, close.'","numberOfPages":"128","price":{"amount":39.95,"currency":"USD"},"images":{"small":"/uploads/covers/0385538235_sm.jpg","medium":"/uploads/covers/0385538235_md.jpg","large":"/uploads/covers/0385538235_lg.jpg"}},{"isbn":"0451524934","title":"1984 (Signet Classics)","author":"George Orwell","numberOfPages":"328","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451524934_sm.jpg","medium":"/uploads/covers/0451524934_md.jpg","large":"/uploads/covers/0451524934_lg.jpg"}},{"isbn":"0689845367","title":"The Tombs of Atuan (The Earthsea Cycle, Book 2)","author":"Ursula K. Le Guin","numberOfPages":"192","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0689845367_sm.jpg","medium":"/uploads/covers/0689845367_md.jpg","large":"/uploads/covers/0689845367_lg.jpg"}},{"isbn":"0060850523","title":"Brave New World","author":"Aldous Huxley","numberOfPages":"288","price":{"amount":14.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060850523_sm.jpg","medium":"/uploads/covers/0060850523_md.jpg","large":"/uploads/covers/0060850523_lg.jpg"}},{"isbn":"0345418921","title":"The Restaurant at the End of the Universe (Hitchhiker's Guide to the Galaxy)","author":"Douglas Adams","description":"Facing annihilation at the hands of the warlike Vogons? Time for a cup of tea! Join the cosmically displaced Arthur Dent and his uncommon comrades in arms in their desperate search for a place to eat, as they hurtle across space powered by pure improbability. <br><br>Among Arthur’s motley shipmates are Ford Prefect, a long-time friend and expert contributer to <b>The Hitchhiker’s Guide to the Galaxy</b>; Zaphod Beeblebrox, the three-armed, two-headed ex-president of the galaxy; Tricia McMillan, a fellow Earth refugee who’s gone native (her name is Trillian now); and Marvin, the moody android. Their destination? The ultimate hot spot for an evening of apocalyptic entertainment and fine dining, where the food speaks for itself (literally). <br><br>Will they make it? The answer: hard to say. But bear in mind that The Hitchhiker’s Guide deleted the term “Future Perfect” from its pages, since it was discovered not to be!","numberOfPages":"256","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/0345418921_sm.jpg","medium":"/uploads/covers/0345418921_md.jpg","large":"/uploads/covers/0345418921_lg.jpg"}},{"isbn":"0062009516","title":"Dodger","author":"Terry Pratchett","description":"<p>Beloved and bestselling author Sir Terry Pratchett's <em>Dodger</em>, a Printz Honor Book, combines high comedy with deep wisdom in a tale of one remarkable boy's rise in a fantasy-infused Victorian London.</p><p> Seventeen-year-old Dodger is content as a sewer scavenger. But he enters a new world when he rescues a young girl from a beating, and her fate impacts some of the most powerful people in England.</p> <p> From Dodger's encounter with the mad barber Sweeney Todd, to his meetings with the great writer Charles Dickens and the calculating politician Benjamin Disraeli, history and fantasy intertwine in a breathtaking account of adventure and mystery.</p>","numberOfPages":"368","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0062009516_sm.jpg","medium":"/uploads/covers/0062009516_md.jpg","large":"/uploads/covers/0062009516_lg.jpg"}},{"isbn":"0553277537","title":"Dandelion Wine (Grand Master Editions)","author":"Ray Bradbury","numberOfPages":"256","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553277537_sm.jpg","medium":"/uploads/covers/0553277537_md.jpg","large":"/uploads/covers/0553277537_lg.jpg"}},{"isbn":"0812513754","title":"Lord of Chaos (The Wheel of Time, Book 6)","author":"Robert Jordan","description":"<div>In this sequel to the phenomenal <i>New York Times</i> bestseller <i>The Fires of Heaven</i>, we plunge again into Robert Jordan's extraordinarily rich, totally unforgettable world:<br><br>On the slopes of Shayol Ghul, the Myrddraal swords are forged, and the sky is not the sky of this world;<br><br>In Salidar the White Tower in exile prepares an embassy to Caemlyn, where Rand Al'Thor, the Dragon Reborn, holds the throne--and where an unexpected visitor may change the world....<br><br>In Emond's Field, Perrin Goldeneyes, Lord of the Two Rivers, feels the pull of ta'veren to ta'veren and prepares to march....<br><br>Morgase of Caemlyn finds a most unexpected, and quite unwelcome, ally....And south lies Illian, where Sammael holds sway....<br></div>","numberOfPages":"1011","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812513754_sm.jpg","medium":"/uploads/covers/0812513754_md.jpg","large":"/uploads/covers/0812513754_lg.jpg"}},{"isbn":"1876963468","title":"The Stars My Destination","author":"Alfred Bester","numberOfPages":"236","price":{"amount":17.95,"currency":"USD"},"images":{"small":"/uploads/covers/1876963468_sm.jpg","medium":"/uploads/covers/1876963468_md.jpg","large":"/uploads/covers/1876963468_lg.jpg"}},{"isbn":"0156027607","title":"Solaris","author":"Stanislaw Lem","description":"<P><B>A classic work of science fiction by renowned Polish novelist and satirist Stanislaw Lem</B></P> <p> </P> <p>When Kris Kelvin arrives at the planet Solaris to study the ocean that covers its surface, he finds a painful, hitherto unconscious memory embodied in the living physical likeness of a long-dead lover. Others examining the planet, Kelvin learns, are plagued with their own repressed and newly corporeal memories. The Solaris ocean may be a massive brain that creates these incarnate memories, though its purpose in doing so is unknown, forcing the scientists to shift the focus of their quest and wonder if they can truly understand the universe without first understanding what lies within their hearts.","numberOfPages":"224","price":{"amount":13,"currency":"USD"},"images":{"small":"/uploads/covers/0156027607_sm.jpg","medium":"/uploads/covers/0156027607_md.jpg","large":"/uploads/covers/0156027607_lg.jpg"}},{"isbn":"0385538308","title":"A Slip of the Keyboard: Collected Nonfiction","author":"Terry Pratchett","description":"<b>Terry Pratchett has won the hearts and minds of readers around the globe with his bestselling Discworld series of novels. But what his many fans may not realize is that he has been writing nonfiction throughout his career. Some of it relates to Discworld, of course, but much of it—especially in recent years—is part of his outspoken campaigns for causes such as Alzheimer‘s research and animal rights.</b><br> <br><br><i>A Slip of the Keyboard</i> is the first collection of Pratchett’s nonfiction work, and it brings together the finest examples of his extraordinary wit and his persuasive prose. Whether in short opinion pieces (on death and taxes), or in long essays, speeches, and interviews (covering a range of topics from mushrooms to orangutans), this collection is a fascinating look inside an extraordinary writer’s mind. It includes his remarks at science-fiction and fantasy conventions, his thoughts on the importance of banana daiquiris on book tours, his observations on fan mail, and his belief that an author is obligated to sign anything a fan puts in front of him (especially if it is very sharp). He also writes about the books that shaped his love of language and legends, not to mention his entrance into science-fiction fandom when he attended his first sci-fi convention as a teenager.<br>     Filled with all the humor and humanity that have made his novels so enduringly popular, this collection brings Pratchett out from behind the scenes of Discworld to speak for himself—man and boy, bibliophile and computer geek; a champion of hats, orangutans, and Dignity in Dying.<br>     With a foreword by Pratchett’s close friend and <i>Good Omens</i> coauthor Neil Gaiman to lead off, <i>A Slip of the Keyboard</i> is a must-have for any Pratchett fan.","numberOfPages":"336","price":{"amount":26.95,"currency":"USD"},"images":{"small":"/uploads/covers/0385538308_sm.jpg","medium":"/uploads/covers/0385538308_md.jpg","large":"/uploads/covers/0385538308_lg.jpg"}},{"isbn":"0380729407","title":"Something Wicked This Way Comes","author":"Ray Bradbury","numberOfPages":"304","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380729407_sm.jpg","medium":"/uploads/covers/0380729407_md.jpg","large":"/uploads/covers/0380729407_lg.jpg"}},{"isbn":"0380016648","title":"The Hand of Oberon (The Chronicles of Amber, Book 4)","author":"Roger Zelazny","description":"Returning to Shadow Earth to investigate a threat against his  life, Corwin discovers that the Jewel of Judgment has been stolen by  his traitorous brother, Brand, who plans to use the enigmatic gem to  reshape the universe. Reissue.","numberOfPages":"188","price":{"amount":5.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380016648_sm.jpg","medium":"/uploads/covers/0380016648_md.jpg","large":"/uploads/covers/0380016648_lg.jpg"}},{"isbn":"0545586178","title":"Catching Fire (The Second Book of the Hunger Games)","author":"Suzanne Collins","description":"<div>Suzanne Collins continues the amazing story of Katniss Everdeen in the phenomenal Hunger Games trilogy.<br><br>Against all odds, Katniss Everdeen has won the annual Hunger Games with fellow district tribute Peeta Mellark. But it was a victory won by defiance of the Capitol and their harsh rules. Katniss and Peeta should be happy. After all, they have just won for themselves and their families a life of safety and plenty. But there are rumors of rebellion among the subjects, and Katniss and Peeta, to their horror, are the faces of that rebellion. The Capitol is angry. The Capitol wants revenge.</div>","numberOfPages":"400","price":{"amount":12.99,"currency":"USD"},"images":{"small":"/uploads/covers/0545586178_sm.jpg","medium":"/uploads/covers/0545586178_md.jpg","large":"/uploads/covers/0545586178_lg.jpg"}},{"isbn":"0679767819","title":"The Demolished Man","author":"Alfred Bester","numberOfPages":"256","price":{"amount":14,"currency":"USD"},"images":{"small":"/uploads/covers/0679767819_sm.jpg","medium":"/uploads/covers/0679767819_md.jpg","large":"/uploads/covers/0679767819_lg.jpg"}},{"isbn":"0441172695","title":"Dune Messiah (The Dune Chronicles, Book 2)","author":"Frank Herbert","description":"<div><b>Dune Messiah</b> continues the story of the man Muad'dib, heir to a power unimaginable, bringing to completion the centuries-old scheme to create a super-being.<p> \"Brilliant...It is all that <b>Dune</b> was, and maybe a little bit more.\" --<b>Galaxy Magazine</b></p></div>","numberOfPages":"336","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441172695_sm.jpg","medium":"/uploads/covers/0441172695_md.jpg","large":"/uploads/covers/0441172695_lg.jpg"}},{"isbn":"0312536631","title":"The Forever War","author":"Joe Haldeman","numberOfPages":"264","price":{"amount":14.99,"currency":"USD"},"images":{"small":"/uploads/covers/0312536631_sm.jpg","medium":"/uploads/covers/0312536631_md.jpg","large":"/uploads/covers/0312536631_lg.jpg"}},{"isbn":"0547572484","title":"The Man in the High Castle","author":"Philip K. Dick","description":"“The single most resonant and carefully imagined book of Dick’s career.” – <I>New York Times</I><br><BR>It's America in 1962. Slavery is legal once again. The few Jews who still survive hide under assumed names. In San Francisco, the <I>I Ching</I> is as common as the <I>Yellow Pages</I>. All because some twenty years earlier the United States lost a war—and is now occupied by Nazi Germany and Japan.<br><BR>This harrowing, Hugo Award-winning novel is the work that established Philip K. Dick as an innovator in science fiction while breaking the barrier between science fiction and the serious novel of ideas. In it Dick offers a haunting vision of history as a nightmare from which it may just be possible to wake.<br><BR>Winner of the Hugo Award<br>","numberOfPages":"288","price":{"amount":13.95,"currency":"USD"},"images":{"small":"/uploads/covers/0547572484_sm.jpg","medium":"/uploads/covers/0547572484_md.jpg","large":"/uploads/covers/0547572484_lg.jpg"}},{"isbn":"0060567236","title":"Lord of Light","author":"Roger Zelazny","numberOfPages":"304","price":{"amount":13.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060567236_sm.jpg","medium":"/uploads/covers/0060567236_md.jpg","large":"/uploads/covers/0060567236_lg.jpg"}},{"isbn":"0684801221","title":"The Old Man and The Sea","author":"Ernest Hemingway","numberOfPages":"128","price":{"amount":12,"currency":"USD"},"images":{"small":"/uploads/covers/0684801221_sm.jpg","medium":"/uploads/covers/0684801221_md.jpg","large":"/uploads/covers/0684801221_lg.jpg"}},{"isbn":"1556525605","title":"A Night in the Lonesome October (Rediscovered Classics)","author":"Roger Zelazny","description":"<P style=\"BORDER-TOP-COLOR: ; BORDER-LEFT-COLOR: ; BORDER-BOTTOM-COLOR: ; MARGIN: 0in 0in 0pt; BORDER-RIGHT-COLOR: \">Loyally accompanying a mysterious knife-wielding gentleman named Jack on his midnight rounds through the murky streets of London, good dog Snuff is busy helping his master collect the grisly ingredients needed for an unearthly rite that will take place not long after the death of the moon. But Snuff and his master are not alone. All manner of participants, both human and not, are gathering with their ancient tools and their animal familiars in preparation for the dread night. It is brave, devoted Snuff who must calculate the patterns of the Game and keep track of the Players—the witch, the mad monk, the vengeful vicar, the Count who sleeps by day, the Good Doctor and the hulking Experiment Man he fashioned from human body parts, and a wild-card American named Larry Talbot—all the while keeping Things at bay and staying a leap ahead of the Great Detective, who knows quite a bit more than he lets on.</P>  <P style=\"BORDER-TOP-COLOR: ; BORDER-LEFT-COLOR: ; BORDER-BOTTOM-COLOR: ; MARGIN: 0in 0in 0pt; BORDER-RIGHT-COLOR: \"> </P>  <P style=\"BORDER-TOP-COLOR: ; BORDER-LEFT-COLOR: ; BORDER-BOTTOM-COLOR: ; MARGIN: 0in 0in 0pt; BORDER-RIGHT-COLOR: \">            Boldly original and wildly entertaining,<I> A Night in the Lonesome October</I> is a darkly sparkling gem, an amalgam of horror, humor, mystery, and fantasy. First published in 1993, it was Zelazny’s last book prior to his untimely death. Many consider it the best of the fantasy master’s novels. It has inspired many fans to read it every year in October, a chapter a day, and served as inspiration for Neil Gaiman’s brilliant story “Only the End of the World Again.”","numberOfPages":"288","price":{"amount":15.95,"currency":"USD"},"images":{"small":"/uploads/covers/1556525605_sm.jpg","medium":"/uploads/covers/1556525605_md.jpg","large":"/uploads/covers/1556525605_lg.jpg"}},{"isbn":"0547572298","title":"Ubik","author":"Philip K. Dick","numberOfPages":"240","price":{"amount":13.95,"currency":"USD"},"images":{"small":"/uploads/covers/0547572298_sm.jpg","medium":"/uploads/covers/0547572298_md.jpg","large":"/uploads/covers/0547572298_lg.jpg"}},{"isbn":"0553293370","title":"Foundation and Empire","author":"Isaac Asimov","description":"The Foundation novels of Isaac Asimov are one of the great masterworks of science fiction.  Unsurpassed for their unique blend of nonstop action, daring ideas, and extensive world-building, they chronicle the struggle of a courageous group of men and women to preserve humanity’s light against an inexorable tide of darkness and violence.<br><br>Led by its founding father, the great psychohistorian Hari Seldon, and taking advantage of its superior science and technology, the Foundation has survived the greed and barbarism of its neighboring warrior-planets.  Yet now it must face the Empire—still the mightiest force in the Galaxy even in its death throes.  When an ambitious general determined to restore the Empire’s glory turns the vast Imperial fleet toward the Foundation, the only hope for the small planet of scholars and scientists lies in the prophecies of Hari Seldon.<br><br>But not even Hari Seldon could have predicted the birth of the extraordinary creature called The Mule—a mutant intelligence with a power greater than a dozen battle fleets…a power that can turn the strongest-willed human into an obedient slave.","numberOfPages":"282","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553293370_sm.jpg","medium":"/uploads/covers/0553293370_md.jpg","large":"/uploads/covers/0553293370_lg.jpg"}},{"isbn":"0743413296","title":"The Doors of His Face, The Lamps of His Mouth","author":"Roger Zelazny","description":"A collection of strange, beautiful stories covering the full spectrum of the late Roger Zelazny's remarkable talents in the fields of fantasy and science fiction.","numberOfPages":"512","price":{"amount":24.94,"currency":"USD"},"images":{"small":"/uploads/covers/0743413296_sm.jpg","medium":"/uploads/covers/0743413296_md.jpg","large":"/uploads/covers/0743413296_lg.jpg"}},{"isbn":"0553572946","title":"Endymion (Hyperion)","author":"Dan Simmons","numberOfPages":"576","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553572946_sm.jpg","medium":"/uploads/covers/0553572946_md.jpg","large":"/uploads/covers/0553572946_lg.jpg"}},{"isbn":"0425158640","title":"Idoru","author":"William Gibson","numberOfPages":"400","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0425158640_sm.jpg","medium":"/uploads/covers/0425158640_md.jpg","large":"/uploads/covers/0425158640_lg.jpg"}},{"isbn":"0399501487","title":"Lord of the Flies","author":"William Golding","numberOfPages":"208","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0399501487_sm.jpg","medium":"/uploads/covers/0399501487_md.jpg","large":"/uploads/covers/0399501487_lg.jpg"}},{"isbn":"0553582011","title":"A Dance with Dragons (A Song of Ice and Fire)","author":"George R. R. Martin","description":"<p><b><b>#1 <i>NEW YORK TIMES </i>BESTSELLER • NOW THE ACCLAIMED HBO SERIES <i>GAME OF THRONES</i></b><br></b><br><b>Don’t miss the thrilling sneak peek of George R. R. Martin’s A Song of Ice and Fire: Book Six, <i>The Winds of Winter</i></b><br><br>Dubbed “the American Tolkien” by <i>Time</i> magazine, George R. R. Martin has earned international acclaim for his monumental cycle of epic fantasy. Now the #1 <i>New York Times</i> bestselling author delivers the fifth book in his landmark series—as both familiar faces and surprising new forces vie for a foothold in a fragmented empire. <br> <br><b>A DANCE WITH DRAGONS</b><br><b>A SONG OF ICE AND FIRE: BOOK FIVE</b><br> <br>In the aftermath of a colossal battle, the future of the Seven Kingdoms hangs in the balance—beset by newly emerging threats from every direction. In the east, Daenerys Targaryen, the last scion of House Targaryen, rules with her three dragons as queen of a city built on dust and death. But Daenerys has thousands of enemies, and many have set out to find her. As they gather, one young man embarks upon his own quest for the queen, with an entirely different goal in mind.<br><br>Fleeing from Westeros with a price on his head, Tyrion Lannister, too, is making his way to Daenerys. But his newest allies in this quest are not the rag-tag band they seem, and at their heart lies one who could undo Daenerys’s claim to Westeros forever.<br><br>Meanwhile, to the north lies the mammoth Wall of ice and stone—a structure only as strong as those guarding it. There, Jon Snow, 998th Lord Commander of the Night’s Watch, will face his greatest challenge. For he has powerful foes not only within the Watch but also beyond, in the land of the creatures of ice.<br><br>From all corners, bitter conflicts reignite, intimate betrayals are perpetrated, and a grand cast of outlaws and priests, soldiers and skinchangers, nobles and slaves, will face seemingly insurmountable obstacles. Some will fail, others will grow in the strength of darkness. But in a time of rising restlessness, the tides of destiny and politics will lead inevitably to the greatest dance of all.<br><br><b>Praise for <i>A Dance with Dragons</i></b><br>  <br> “Filled with vividly rendered set pieces, unexpected turnings, assorted cliffhangers and moments of appalling cruelty, <i>A Dance with Dragons</i> is epic fantasy as it should be written: passionate, compelling, convincingly detailed and thoroughly imagined.”<b>—<i>The Washington Post</i></b><br> <i> </i><br> “Long live George Martin . . . a literary dervish, enthralled by complicated characters and vivid language, and bursting with the wild vision of the very best tale tellers.”<b><i>—The New York Times</i></b><br> <i> </i><br> “One of the best series in the history of fantasy.”<b><i>—Los Angeles Times</i></b> </p><br><br><br><i>From the Trade Paperback edition.</i>","numberOfPages":"1152","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553582011_sm.jpg","medium":"/uploads/covers/0553582011_md.jpg","large":"/uploads/covers/0553582011_lg.jpg"}},{"isbn":"1475031904","title":"Breakthrough","author":"Michael C. Grumley","description":"<div><b><i>\"If you like Action/Adventure, read this book.\" - Michael Lampard</i></b><br><br><i>\"Intriguing and suspenseful from the beginning to the very end.\" - Dr. Bojan Tunguz - AMAZON TOP 50 & HALL OF FAME REVIEWER</i><br>_____________________________________________________<br><br><b>A TECHNOLOGY THAT WILL CHANGE WHAT IT MEANS TO BE HUMAN...</b><br><b>A DISCOVERY THAT QUESTIONS THE VERY LAWS OF PHYSICS...</b><br><b>...AND A CATASTROPHE THAT CANNOT BE STOPPED.</b><br><br>Deep in the Caribbean Sea, a nuclear submarine is forced to suddenly abort its mission under mysterious circumstances. Strange facts begin to emerge that lead naval investigator, John Clay, to a small group of marine biologists who are quietly on the verge of making history.<br><br>With the help of a powerful computer system, Alison Shaw and her team are preparing to translate the first two-way conversation with the planet's second smartest species.  But the team discovers much more from their dolphins than they ever expected when a secret object is revealed on the ocean floor.  One that was never supposed to be found.<br><br>Alison was sure she would never trust the military again.  However, when an unknown group immediately becomes interested in her work, Alison realizes John Clay may be the only person she <i>can</i> trust.  Together they must piece together a dangerous puzzle, and the most frightening piece, is the trembling in Antarctica.<br><br>To make matters worse, someone from the inside is trying to stop them.  Now time is running out...and our understanding of the world is about to change forever.</div>","numberOfPages":"322","price":{"amount":12.99,"currency":"USD"},"images":{"small":"/uploads/covers/1475031904_sm.jpg","medium":"/uploads/covers/1475031904_md.jpg","large":"/uploads/covers/1475031904_lg.jpg"}},{"isbn":"1503290565","title":"Pride and Prejudice","author":"Jane Austen","description":"Pride and Prejudice is a novel of manners by Jane Austen, first published in 1813. The story follows the main character, Elizabeth Bennet, as she deals with issues of manners, upbringing, morality, education, and marriage in the society of the landed gentry of the British Regency. Elizabeth is the second of five daughters of a country gentleman living near the fictional town of Meryton in Hertfordshire, near London. Page 2 of a letter from Jane Austen to her sister Cassandra (11 June 1799) in which she first mentions Pride and Prejudice, using its working title First Impressions. Set in England in the early 19th century, Pride and Prejudice tells the story of Mr and Mrs Bennet's five unmarried daughters after the rich and eligible Mr Bingley and his status-conscious friend, Mr Darcy, have moved into their neighbourhood. While Bingley takes an immediate liking to the eldest Bennet daughter, Jane, Darcy has difficulty adapting to local society and repeatedly clashes with the second-eldest Bennet daughter, Elizabeth. Though Austen set the story at the turn of the 19th century, it retains a fascination for modern readers, continuing near the top of lists of \"most loved books.\" It has become one of the most popular novels in English literature, selling over 20 million copies, and receives considerable attention from literary scholars. Modern interest in the book has resulted in a number of dramatic adaptations and an abundance of novels and stories imitating Austen's memorable characters or themes.","numberOfPages":"226","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/1503290565_sm.jpg","medium":"/uploads/covers/1503290565_md.jpg","large":"/uploads/covers/1503290565_lg.jpg"}},{"isbn":"0743273567","title":"The Great Gatsby","author":"F. Scott Fitzgerald","numberOfPages":"180","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/0743273567_sm.jpg","medium":"/uploads/covers/0743273567_md.jpg","large":"/uploads/covers/0743273567_lg.jpg"}},{"isbn":"9780439023528","title":"The Hunger Games (Book 1)","author":"Suzanne Collins","description":"<p>In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts.  Long ago the districts waged war on the Capitol and were defeated. As part of the surrender terms, each district agreed to send one boy and one girl to appear in an annual televised event called, \"The Hunger Games,\" a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she is forced to represent her district in the Games. The terrain, rules, and level of audience participation may change but one thing is constant: kill or be killed.</p>  </div>","numberOfPages":"384","price":{"amount":10.99,"currency":"USD"},"images":{"small":"/uploads/covers/9780439023528_sm.jpg","medium":"/uploads/covers/9780439023528_md.jpg","large":"/uploads/covers/9780439023528_lg.jpg"}},{"isbn":"0743413016","title":"The Dream Master (The Nebula Award-Winning Novel)","author":"Roger Zelazny","description":"His name is Charles Render, and he is a psychoanalyst, and a mechanic of dreams. A Shaper. In a warm womb of metal, his patients dream their neuroses, while Render, intricately connected to their brains, dreams with them, makes delicate adjustments, and ultimately explains and heals. Her name is Eileen Shallot, a resident in psychiatry. She wants desperately to become a Shaper, though she has been blind from birth. Together, they will explore the depths of the human mind -- and the terrors that lurk therein","numberOfPages":"256","price":{"amount":13.95,"currency":"USD"},"images":{"small":"/uploads/covers/0743413016_sm.jpg","medium":"/uploads/covers/0743413016_md.jpg","large":"/uploads/covers/0743413016_lg.jpg"}},{"isbn":"9781451678192","title":"The Martian Chronicles","author":"Ray Bradbury","numberOfPages":"256","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/9781451678192_sm.jpg","medium":"/uploads/covers/9781451678192_md.jpg","large":"/uploads/covers/9781451678192_lg.jpg"}},{"isbn":"0345404475","title":"Do Androids Dream of Electric Sheep?","author":"Philip K. Dick","numberOfPages":"256","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/0345404475_sm.jpg","medium":"/uploads/covers/0345404475_md.jpg","large":"/uploads/covers/0345404475_lg.jpg"}},{"isbn":"0140177396","title":"Of Mice and Men","author":"John Steinbeck","description":"<div>  <b>A controversial tale of friendship and tragedy during the Great Depression</b><br>    <br>   They are an unlikely pair: George is \"small and quick and dark of face\"; Lennie, a man of tremendous size, has the mind of a young child. Yet they have formed a \"family,\" clinging together in the face of loneliness and alienation.<br>  <br>   Laborers in California's dusty vegetable fields, they hustle work when they can, living a hand-to-mouth existence. For George and Lennie have a plan: to own an acre of land and a shack they can call their own. When they land jobs on a ranch in the Salinas Valley, the fulfillment of their dream seems to be within their grasp. But even George cannot guard Lennie from the provocations of a flirtatious woman, nor predict the consequences of Lennie's unswerving obedience to the things George taught him.<br>  <br>   \"A thriller, a gripping tale . . . that you will not set down until it is finished. Steinbeck has touched the quick.\" —<i>The New York Times</i></div><br>","numberOfPages":"112","price":{"amount":11,"currency":"USD"},"images":{"small":"/uploads/covers/0140177396_sm.jpg","medium":"/uploads/covers/0140177396_md.jpg","large":"/uploads/covers/0140177396_lg.jpg"}},{"isbn":"0446310786","title":"To Kill a Mockingbird","author":"Harper Lee","numberOfPages":"384","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0446310786_sm.jpg","medium":"/uploads/covers/0446310786_md.jpg","large":"/uploads/covers/0446310786_lg.jpg"}},{"isbn":"0380000830","title":"The Guns of Avalon (Chronicles of Amber, No. 2)","author":"Roger Zelazny","description":"Seeking vengeance against his usurping brother, Eric, Corwin,  the rightful heir to the throne, ventures into the dark world of Shadow  in order to gather ammunition, and is distracted by a beautiful and  mysterious woman. Reissue.","numberOfPages":"222","price":{"amount":5.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380000830_sm.jpg","medium":"/uploads/covers/0380000830_md.jpg","large":"/uploads/covers/0380000830_lg.jpg"}},{"isbn":"0451210859","title":"The Drawing of the Three: (The Dark Tower #2)","author":"Stephen King","description":"<div>In 1978, Stephen King introduced the world to the last gunslinger, Roland of Gilead.  Nothing has been the same since. More than twenty years later, the quest for the Dark Tower continues to take readers on a wildly epic ride. Through parallel worlds and across time, Roland must brave desolate wastelands and endless deserts, drifting into the unimaginable and the familiar. A classic tale of colossal scopecrossing over terrain from <i>The Stand</i>, <i>The Eyes of the Dragon</i>, <i>Insomnia</i>, <i>The Talisman</i>, <i>Black House</i>, <i>Hearts in Atlantis</i>, <i>’Salem’s Lot</i>, and other familiar King hauntsthe adventure takes hold with the turn of each page.<br><br> And the tower awaits....<br><br> <b>The Second Volume in the Epic Dark Tower Series<br><br> <u>The Drawing of the Three</u></b><br><br> While pursuing his quest for the Dark Tower through a world that is a nightmarishly distorted mirror image of our own, Roland is drawn through a mysterious door that brings him into contemporary America.<br><br> Here he links forces with the defiant young Eddie Dean, and with the beautiful, brilliant, and brave Odetta Holmes, in a savage struggle against underworld evil and otherworldly enemies.<br><br> Once again, Stephen King has masterfully interwoven dark, evocative fantasy and icy realism.<br></div>","numberOfPages":"480","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0451210859_sm.jpg","medium":"/uploads/covers/0451210859_md.jpg","large":"/uploads/covers/0451210859_lg.jpg"}},{"isbn":"1416521496","title":"Song of Susannah (The Dark Tower, Book 6)","author":"Stephen King","description":"SONG OF SUSANNAH <BR> THE DARK TOWER VI <BR> <BR> Susannah Dean is possessed, her body a living vessel for the demon-mother Mia. Something is growing inside Susannah's belly, something terrible, and soon she will give birth to Mia's \"chap.\" But three unlikely allies are following them from New York City to the border of End World, hoping to prevent the unthinkable. Meanwhile, Eddie and Roland have tumbled into the state of Maine -- where the author of a novel called <i>'Salem's Lot</i> is about to meet his destiny....","numberOfPages":"560","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/1416521496_sm.jpg","medium":"/uploads/covers/1416521496_md.jpg","large":"/uploads/covers/1416521496_lg.jpg"}},{"isbn":"0451159764","title":"Jack of Shadows (Signet)","author":"Roger Zelazny","description":"Shadowjack walks in silence and in shadows to seek vengeance upon his enemies. Who are his foes? All who would despise him or love the Lord of Bats: Smage of the Jackass Ears, the Colonel Who Never Died, the Borshin, and Quazer, winner of the Hellgames and abductor of the voluptuous Evene. One by one, Shadowjack would seek them out and have his revenge, building his power as he goes. And once his vengeance is obtained, he would come to terms with all others who are against him, he would unite the World of High Dudgeon, destroy the Land of Filth, and bring peace to the Shadowguard. But to accomplish all, Jack of Shadows must find Kolwynia, the Key That Was Lost...","numberOfPages":"236","price":{"amount":3.95,"currency":"USD"},"images":{"small":"/uploads/covers/0451159764_sm.jpg","medium":"/uploads/covers/0451159764_md.jpg","large":"/uploads/covers/0451159764_lg.jpg"}},{"isbn":"0441569595","title":"Neuromancer","author":"William Gibson","numberOfPages":"271","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441569595_sm.jpg","medium":"/uploads/covers/0441569595_md.jpg","large":"/uploads/covers/0441569595_lg.jpg"}},{"isbn":"0316769487","title":"The Catcher in the Rye","author":"J.D. Salinger","numberOfPages":"224","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0316769487_sm.jpg","medium":"/uploads/covers/0316769487_md.jpg","large":"/uploads/covers/0316769487_lg.jpg"}},{"isbn":"0399158448","title":"The Peripheral","author":"William Gibson","description":"<div>  <b>William Gibson returns with his first novel since 2010’s<i> New York Times</i>bestselling <i>Zero History</i>.</b><br>  <br>   Where Flynne and her brother, Burton, live, jobs outside the drug business are rare. Fortunately, Burton has his veteran’s benefits, for neural damage he suffered from implants during his time in the USMC’s elite Haptic Recon force. Then one night Burton has to go out, but there’s a job he’s supposed to doa job Flynne didn’t know he had. Beta-testing part of a new game, he tells her. The job seems to be simple: work a perimeter around the image of a tower building. Little buglike things turn up. He’s supposed to get in their way, edge them back. That’s all there is to it. He’s offering Flynne a good price to take over for him. What she sees, though, isn’t what Burton told her to expect. It might be a game, but it might also be murder.</div>","numberOfPages":"496","price":{"amount":28.95,"currency":"USD"},"images":{"small":"/uploads/covers/0399158448_sm.jpg","medium":"/uploads/covers/0399158448_md.jpg","large":"/uploads/covers/0399158448_lg.jpg"}},{"isbn":"0060502932","title":"Going Postal (Discworld)","author":"Terry Pratchett","description":"<p>Suddenly, condemned arch-swindler Moist von Lipwig found himself with a noose around his neck and dropping through a trapdoor into ... a government job?</p><p>By all rights, Moist should be meeting his maker rather than being offered a position as Postmaster by Lord Vetinari, supreme ruler of Ankh-Morpork. Getting the moribund Postal Service up and running again, however, may prove an impossible task, what with literally mountains of decades-old undelivered mail clogging every nook and cranny of the broken-down post office. Worse still, Moist could swear the mail is talking to him. Worst of all, it means taking on the gargantuan, greedy Grand Trunk clacks communication monopoly and its bloodthirsty piratical headman. But if the bold and undoable are what's called for, Moist's the man for the job -- to move the mail, continue breathing, get the girl, and specially deliver that invaluable commodity that every being, human or otherwise, requires: hope.</p>","numberOfPages":"416","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060502932_sm.jpg","medium":"/uploads/covers/0060502932_md.jpg","large":"/uploads/covers/0060502932_lg.jpg"}},{"isbn":"1451673310","title":"Fahrenheit 451: A Novel","author":"Ray Bradbury","numberOfPages":"249","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/1451673310_sm.jpg","medium":"/uploads/covers/1451673310_md.jpg","large":"/uploads/covers/1451673310_lg.jpg"}},{"isbn":"0380014300","title":"Nine Princes In Amber","author":"Roger Zelazny","description":"Awakening in an Earth hospital unable to remember who he is or  where he came from, Corwin is amazed to learn that he is one of the  sons of Oberon, King of Amber, and is the rightful successor to the  crown in a parallel world. Reissue.","numberOfPages":"175","price":{"amount":5.99,"currency":"USD"},"images":{"small":"/uploads/covers/0380014300_sm.jpg","medium":"/uploads/covers/0380014300_md.jpg","large":"/uploads/covers/0380014300_lg.jpg"}},{"isbn":"0812513738","title":"The Shadow Rising (The Wheel of Time, Book 4)","author":"Robert Jordan","description":"<DIV>The seals of Shayol Ghul are weak now, and the Dark One reaches out. The Shadow is rising to cover humankind.</DIV><DIV> </DIV><DIV>In Tar Valon, Min sees portents of hideous doom. Will the White Tower itself be broken?</DIV><DIV> </DIV><DIV>In the Two Rivers, the Whitecloaks ride in pursuit of a man with golden eyes, and in pursuit of the Dragon Reborn.<BR><BR>In Cantorin, among the Sea Folk, High Lady Suroth plans the return of the Seanchan armies to the mainland.<BR><BR>In the Stone of Tear, the Lord Dragon considers his next move. It will be something no one expects, not the Black Ajah, not Tairen nobles, not Aes Sedai, not Egwene or Elayne or Nynaeve.<BR><BR>Against the Shadow rising stands the Dragon Reborn.....<BR></DIV>","numberOfPages":"1007","price":{"amount":8.99,"currency":"USD"},"images":{"small":"/uploads/covers/0812513738_sm.jpg","medium":"/uploads/covers/0812513738_md.jpg","large":"/uploads/covers/0812513738_lg.jpg"}},{"isbn":"0811213641","title":"Omon Ra","author":"Victor Pelevin","numberOfPages":"154","price":{"amount":14.95,"currency":"USD"},"images":{"small":"/uploads/covers/0811213641_sm.jpg","medium":"/uploads/covers/0811213641_md.jpg","large":"/uploads/covers/0811213641_lg.jpg"}},{"isbn":"1596870745","title":"This Immortal","author":"Roger Zelazny","description":"Conrad Nomikos has a long, rich personal history that he'd rather not talk about and a job he'd rather not do. Escorting an alien grandee on a tour around a shattered post-nuclear war Earth is not something he relishes, especially when he becomes central to an intrigue determining Earth's future.","numberOfPages":"176","price":{"amount":17.95,"currency":"USD"},"images":{"small":"/uploads/covers/1596870745_sm.jpg","medium":"/uploads/covers/1596870745_md.jpg","large":"/uploads/covers/1596870745_lg.jpg"}},{"isbn":"0060853980","title":"Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch","author":"Neil Gaiman","numberOfPages":"432","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060853980_sm.jpg","medium":"/uploads/covers/0060853980_md.jpg","large":"/uploads/covers/0060853980_lg.jpg"}},{"isbn":"1400049628","title":"The Zombie Survival Guide: Complete Protection from the Living Dead","author":"Max Brooks","description":"The <em>Zombie Survival Guide</em> is your key to survival against the hordes of undead who may be stalking you right now.  Fully illustrated and exhaustively comprehensive, this book covers everything you need to know, including how to understand zombie physiology and behavior, the most effective defense tactics and weaponry, ways to outfit your home for a long siege, and how to survive and adapt in any territory or terrain.<br /><br />Top 10 Lessons for Surviving a Zombie Attack <br /><br />1. Organize before they rise! <br />2. They feel no fear, why should you?<br />3. Use your head: cut off theirs.<br />4. Blades don’t need reloading.<br />5. Ideal protection = tight clothes, short hair.<br />6. Get up the staircase, then destroy it. <br />7. Get out of the car, get onto the bike.<br />8. Keep moving, keep low, keep quiet, keep alert!<br />9. No place is safe, only safer.  <br />10. The zombie may be gone, but the threat lives on. <br /><br />Don’t be carefree and foolish with your most precious asset—life. This book is your key to survival against the hordes of undead who may be stalking you right now without your even knowing it. The Zombie Survival Guide offers complete protection through trusted, proven tips for safeguarding yourself and your loved ones against the living dead. It is a book that can save your life.","numberOfPages":"288","price":{"amount":14.99,"currency":"USD"},"images":{"small":"/uploads/covers/1400049628_sm.jpg","medium":"/uploads/covers/1400049628_md.jpg","large":"/uploads/covers/1400049628_lg.jpg"}},{"isbn":"0345413989","title":"2061: Odyssey Three","author":"Arthur C. Clarke","description":"Arthur C. Clark, creator of one of the world's best-loved science fiction tales, revisits the most famous future ever imagined in this NEW YORK TIMES bestseller, as two expeditions into space become inextricably tangled. Heywood Floyd, survivor of two previous encounters with the mysterious monloiths, must again confront Dave Bowman, HAL, and an alien race that has decided that Mankind is to play a part in the evolution of the galaxy whether it wishes to or not.","numberOfPages":"304","price":{"amount":14.95,"currency":"USD"},"images":{"small":"/uploads/covers/0345413989_sm.jpg","medium":"/uploads/covers/0345413989_md.jpg","large":"/uploads/covers/0345413989_lg.jpg"}},{"isbn":"0553293354","title":"Foundation","author":"Isaac Asimov","numberOfPages":"296","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0553293354_sm.jpg","medium":"/uploads/covers/0553293354_md.jpg","large":"/uploads/covers/0553293354_lg.jpg"}},{"isbn":"1503278190","title":"Jane Eyre","author":"Charlotte Bronte","description":"Jane Eyre (originally published as Jane Eyre: An Autobiography) is a novel by English writer Charlotte Brontë. It was published on 16 October 1847 by Smith, Elder & Co. of London, England, under the pen name \"Currer Bell.\" The first American edition was released the following year by Harper & Brothers of New York. Primarily of the bildungsroman genre, Jane Eyre follows the emotions and experiences of its title character, including her growth to adulthood, and her love for Mr. Rochester, the byronic master of fictitious Thornfield Hall. In its internalisation of the action — the focus is on the gradual unfolding of Jane's moral and spiritual sensibility and all the events are coloured by a heightened intensity that was previously the domain of poetry — Jane Eyre revolutionised the art of fiction. Charlotte Brontë has been called the 'first historian of the private consciousness' and the literary ancestor of writers like Joyce and Proust. The novel contains elements of social criticism, with a strong sense of morality at its core, but is nonetheless a novel many consider ahead of its time given the individualistic character of Jane and the novel's exploration of classism, sexuality, religion, and proto-feminism.","numberOfPages":"290","price":{"amount":10.99,"currency":"USD"},"images":{"small":"/uploads/covers/1503278190_sm.jpg","medium":"/uploads/covers/1503278190_md.jpg","large":"/uploads/covers/1503278190_lg.jpg"}},{"isbn":"0441102670","title":"Chapterhouse: Dune (Dune Chronicles, Book 6)","author":"Frank Herbert","description":"<div>The desert planet Arrakis, called Dune, has been destroyed. Now, the Bene Gesserit, heirs to Dune's power, have colonized a green world--and are turning it into a desert, mile by scorched mile.<br><p> Here is the last book <b>Frank Herbert</b> wrote before his death. A stunning climax to the epic Dune legend that will live on forever...</p></div>","numberOfPages":"448","price":{"amount":9.99,"currency":"USD"},"images":{"small":"/uploads/covers/0441102670_sm.jpg","medium":"/uploads/covers/0441102670_md.jpg","large":"/uploads/covers/0441102670_lg.jpg"}},{"isbn":"0345418913","title":"The Hitchhiker's Guide to the Galaxy","author":"Douglas Adams","numberOfPages":"208","price":{"amount":15,"currency":"USD"},"images":{"small":"/uploads/covers/0345418913_sm.jpg","medium":"/uploads/covers/0345418913_md.jpg","large":"/uploads/covers/0345418913_lg.jpg"}},{"isbn":"0345303067","title":"2010: Odyssey Two","author":"Arthur C. Clarke","description":"2001: A Space Odyssey shocked, amazed, and delighted millions in the late 1960s. An instant book and movie classic, its fame has grown over the years. Yet along with the almost universal acclaim, a host of questions has grown more insistent through the years, for example: who or what transformed Dave Bowman into the Star-Child? What alien purpose lay behind the monoliths on the Moon and out in space? What could drive HAL to kill the crew? Now all those questions and many more have been answered, in this stunning sequel to the international bestseller. Cosmic in sweep, eloquent in its depiction of Man's place in the Universe, and filled with the romance of space, this novel is a monumental achievement and a must-read for Arthur C. Clarke fans old and new.<br>\"A daring romp through the solar system and a worthy successor to 2001.\"<br>Carl Sagan","numberOfPages":"352","price":{"amount":7.99,"currency":"USD"},"images":{"small":"/uploads/covers/0345303067_sm.jpg","medium":"/uploads/covers/0345303067_md.jpg","large":"/uploads/covers/0345303067_lg.jpg"}},{"isbn":"0547572174","title":"A Scanner Darkly","author":"Philip K. Dick","numberOfPages":"304","price":{"amount":13.95,"currency":"USD"},"images":{"small":"/uploads/covers/0547572174_sm.jpg","medium":"/uploads/covers/0547572174_md.jpg","large":"/uploads/covers/0547572174_lg.jpg"}},{"isbn":"0026151200","title":"Beetle in the Anthill (Best of Soviet Science Fiction)","author":"Arkady Strugatsky","description":"No description yet","numberOfPages":"192","price":{"amount":11.95,"currency":"USD"},"images":{"small":"/uploads/covers/0026151200_sm.jpg","medium":"/uploads/covers/0026151200_md.jpg","large":"/uploads/covers/0026151200_lg.jpg"}},{"isbn":"0060539828","title":"Burning Chrome","author":"William Gibson","numberOfPages":"224","price":{"amount":13.99,"currency":"USD"},"images":{"small":"/uploads/covers/0060539828_sm.jpg","medium":"/uploads/covers/0060539828_md.jpg","large":"/uploads/covers/0060539828_lg.jpg"}}]